STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_OnOff_ChannelsAgility_SEDRejoin/STM32_WPAN/App/app_zigbee.c

/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : App/app_zigbee.c
  * Description        : Zigbee Application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "stm32_seq.h"
#include "stm32_lpm.h"

/* Private includes -----------------------------------------------------------*/
#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/general/zcl.onoff.h"

/* USER CODE BEGIN Includes */
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               113U
#define CHANNEL3                                     24
#define CHANNEL2                                     21
#define CHANNEL1                                     16
#define ZED_SLEEP_TIME_30S                           1 /* 30s sleep time unit */

#define SW1_ENDPOINT                                17

/* USER CODE BEGIN PD */
#define HW_TS_SERVER_4S_NB_TICKS                    (4*1000*1000/CFG_TS_TICK_VAL) /* 4s */ 
/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* External definition -------------------------------------------------------*/
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);
enum ZbStatusCodeT ZbStartupRejoinWait(struct ZigBeeT *zb);

/* USER CODE BEGIN ED */
/* USER CODE END ED */

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_NwkForm(void);

static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);

/* USER CODE BEGIN PFP */
static void APP_ZIGBEE_App_Init(void);
static void APP_ZIGBEE_OnOff_Client_Init(void);
static void APP_ZIGBEE_OnOff_Toggle(void);
/* USER CODE END PFP */

/* Private variables ---------------------------------------------------------*/
static TL_CmdPacket_t *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t CptReceiveNotifyFromM0 = 0;
static __IO uint32_t CptReceiveRequestFromM0 = 0;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];

struct zigbee_app_info {
  bool has_init;
  struct ZigBeeT *zb;
  enum ZbStartType startupControl;
  enum ZbStatusCodeT join_status;
  uint32_t join_delay;
  bool init_after_join;

  struct ZbZclClusterT *onOff_client_1;
};
static struct zigbee_app_info zigbee_app_info;
static void toggle_cb(struct ZbZclCommandRspT *rsp, void *arg);

/* USER CODE BEGIN PV */
enum zb_msg_filter_rc app_zb_msg_filter_cb(struct ZigBeeT *zb, uint32_t id, void *msg, void *cbarg);

static uint8_t TS_ID1;

/* USER CODE END PV */
/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Zigbee Message Filter callback
 * @param  zb, id, msg, arg
 * @retval zb_msg_filter_rc
 */
enum zb_msg_filter_rc app_zb_msg_filter_cb(struct ZigBeeT *zb, uint32_t id, void *msg, void *arg)
{
    if (id == ZB_MSG_FILTER_STATUS_IND) {
        // Attempt to switch values with a different context.
        /* generating more problem than solution since might occur with the RF environment  
        uint8_t val8;
        val8 = 3;
        ZbApsSet(zigbee_app_info.zb, ZB_APS_IB_ID_SCAN_COUNT, &val8, sizeof(val8));
        uint16_t val16;
        val16 = 4;
        ZbBdbSet(zigbee_app_info.zb, ZB_BDB_ScanDuration, &val16, sizeof(val16));
        val16 = 251;
        ZbNwkSet(zigbee_app_info.zb, ZB_NWK_NIB_ID_FastPollPeriod, &val16, sizeof(val16));
        val16 = 9;
        ZbNwkSet(zigbee_app_info.zb, ZB_NWK_NIB_ID_NetworkBroadcastDeliveryTime, &val16, sizeof(val16));
        */
        struct ZbNlmeNetworkStatusIndT *ind = msg;
        APP_DBG("NetworkNlmeNetworkStatusIndT status %d",ind->status);
        switch (ind->status) {
            case ZB_NWK_STATUS_CODE_PARENT_LINK_FAILURE:
                /* Set a flag for application to attempt to rejoin network */
                /* Since we will handle this in the application, tell stack 
                 * to not process this message further by returning ZB_MSG_DISCARD. */
                APP_DBG("Network Lost / Parent Link Failure");
                HW_TS_Start(TS_ID1, 5*HW_TS_SERVER_4S_NB_TICKS);
                return ZB_MSG_DISCARD;

            default:
                break;
        }
    }
    return ZB_MSG_CONTINUE;
}

/**
 * @brief  Zigbee Rejoin Callback
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_Rejoin_NotAuto(void){

  APP_DBG("Rejoin Callback Not Automatic");
  APP_DBG("Network RejoinCb status %d",zigbee_app_info.zb);
  if(ZbStartupRejoinWait(zigbee_app_info.zb) != ZB_STATUS_SUCCESS) {
       /* Handle error. Try to rejoin again later? */
        APP_DBG("Rejoin failure / Retry in 20 seconds");
        HW_TS_Start(TS_ID1, HW_TS_SERVER_4S_NB_TICKS);
  }
  else 
  {
       APP_DBG("Rejoin success");
       HW_TS_Create(CFG_TIM_ZIGBEE_APP_ONOFF_TOGGLE_ONESHOT, &TS_ID1, hw_ts_SingleShot, APP_ZIGBEE_OnOff_Toggle);
       HW_TS_Start(TS_ID1, HW_TS_SERVER_4S_NB_TICKS);
  }

return;
}

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;

