STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_OnOff_ChannelsAgility_SEDRejoin/STM32_WPAN/App/app_zigbee.c
  /* Wait completion of cmd */
  Wait_Getting_Ack_From_M0();
} /* ZIGBEE_CmdTransfer */

/**
 * @brief  This function is called when the M0+ acknowledge the fact that it has received a Cmd
 *
 *
 * @param   Otbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_ZIGBEE_CmdEvtReceived(TL_EvtPacket_t *Otbuffer)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Otbuffer);

  Receive_Ack_From_M0();
} /* TL_ZIGBEE_CmdEvtReceived */

/**
 * @brief  This function is called when notification from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_ZIGBEE_NotReceived(TL_EvtPacket_t *Notbuffer)
{
  p_ZIGBEE_notif_M0_to_M4 = Notbuffer;

  Receive_Notification_From_M0();
} /* TL_ZIGBEE_NotReceived */

/**
 * @brief  This function is called before sending any ot command to the M0
 *         core. The purpose of this function is to be able to check if
 *         there are no notifications coming from the M0 core which are
 *         pending before sending a new ot command.
 * @param  None
 * @retval None
 */
void Pre_ZigbeeCmdProcessing(void)
{
  UTIL_SEQ_WaitEvt(EVENT_SYNCHRO_BYPASS_IDLE);
} /* Pre_ZigbeeCmdProcessing */

/**
 * @brief  This function waits for getting an acknowledgment from the M0.
 *
 * @param  None
 * @retval None
 */
static void Wait_Getting_Ack_From_M0(void)
{
  UTIL_SEQ_WaitEvt(EVENT_ACK_FROM_M0_EVT);
} /* Wait_Getting_Ack_From_M0 */

/**
 * @brief  Receive an acknowledgment from the M0+ core.
 *         Each command send by the M4 to the M0 are acknowledged.
 *         This function is called under interrupt.
 * @param  None
 * @retval None
 */
static void Receive_Ack_From_M0(void)
{
  UTIL_SEQ_SetEvt(EVENT_ACK_FROM_M0_EVT);
} /* Receive_Ack_From_M0 */

/**
 * @brief  Receive a notification from the M0+ through the IPCC.
 *         This function is called under interrupt.
 * @param  None
 * @retval None
 */
static void Receive_Notification_From_M0(void)
{
    CptReceiveNotifyFromM0++;
    UTIL_SEQ_SetTask(1U << (uint32_t)CFG_TASK_NOTIFY_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
}

/**
 * @brief  This function is called when a request from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_ZIGBEE_M0RequestReceived(TL_EvtPacket_t *Reqbuffer)
{
    p_ZIGBEE_request_M0_to_M4 = Reqbuffer;

    CptReceiveRequestFromM0++;
    UTIL_SEQ_SetTask(1U << (uint32_t)CFG_TASK_REQUEST_FROM_M0_TO_M4, CFG_SCH_PRIO_0);
}

/**
 * @brief Perform initialization of TL for Zigbee.
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_TL_INIT(void)
{
    ZigbeeConfigBuffer.p_ZigbeeOtCmdRspBuffer = (uint8_t *)&ZigbeeOtCmdBuffer;
    ZigbeeConfigBuffer.p_ZigbeeNotAckBuffer = (uint8_t *)ZigbeeNotifRspEvtBuffer;
    ZigbeeConfigBuffer.p_ZigbeeNotifRequestBuffer = (uint8_t *)ZigbeeNotifRequestBuffer;
    TL_ZIGBEE_Init(&ZigbeeConfigBuffer);
}

/**
 * @brief Process the messages coming from the M0.
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_ProcessNotifyM0ToM4(void)
{
    if (CptReceiveNotifyFromM0 != 0) {
        /* If CptReceiveNotifyFromM0 is > 1. it means that we did not serve all the events from the radio */
        if (CptReceiveNotifyFromM0 > 1U) {
            APP_ZIGBEE_Error(ERR_REC_MULTI_MSG_FROM_M0, 0);
        }
        else {
            Zigbee_CallBackProcessing();
        }
        /* Reset counter */
        CptReceiveNotifyFromM0 = 0;
    }
}

/**
 * @brief Process the requests coming from the M0.
 * @param
 * @return
 */
void APP_ZIGBEE_ProcessRequestM0ToM4(void)
{
    if (CptReceiveRequestFromM0 != 0) {
        Zigbee_M0RequestProcessing();
        CptReceiveRequestFromM0 = 0;
    }
}
/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_App_Init(void){
  
  /* Timer creation */
  HW_TS_Create(CFG_TIM_ZIGBEE_APP_ONOFF_TOGGLE_ONESHOT, &TS_ID1, hw_ts_SingleShot, APP_ZIGBEE_OnOff_Toggle);
  
  APP_ZIGBEE_OnOff_Client_Init();
//      APP_DBG("Network config : APP_STARTUP_CENTRALIZED_END_DEVICE");

} /* APP_ZIGBEE_App_Init */

/**
 * @brief  On Off client initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_OnOff_Client_Init(void){
  /* Start the timer */
  HW_TS_Start(TS_ID1, (HW_TS_SERVER_4S_NB_TICKS));
} /* APP_ZIGBEE_OnOff_Client_Init */

/**
 * @brief  On Off toggle commamd
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_OnOff_Toggle(void){   
     
  struct ZbApsAddrT dst;
  
  /* Setting up the destination */
  memset(&dst, 0, sizeof(dst));
  dst.mode = ZB_APSDE_ADDRMODE_SHORT;
  dst.endpoint = SW1_ENDPOINT;
  dst.nwkAddr = 0x0;

  /* Sending the request */
  if (ZbZclOnOffClientToggleReq(zigbee_app_info.onOff_client_1, &dst, toggle_cb, NULL) == ZCL_STATUS_SUCCESS) {
   APP_DBG("WARNING: ZC LED_RED and SED LED_GREEN can be disalligned if a response from ZC failed, in which case ZC will stop toggling");
   BSP_LED_Toggle(LED_GREEN);
  } else {
   APP_DBG("Error, ZbZclOnOffClientToggleReq failed.");
   HW_TS_Create(CFG_TIM_ZIGBEE_APP_REJOIN, &TS_ID1, hw_ts_SingleShot, APP_ZIGBEE_Rejoin_NotAuto);
  }
}
static void toggle_cb(struct ZbZclCommandRspT *rsp, void *arg)
{
  if(rsp->status != ZCL_STATUS_SUCCESS)
  {
    APP_DBG("TOGGLE RSP FAIL status %d",rsp->status);
    BSP_LED_Off(LED_BLUE);
    
    /* Timer associated with Rejoin Process */
    HW_TS_Create(CFG_TIM_ZIGBEE_APP_REJOIN, &TS_ID1, hw_ts_SingleShot, APP_ZIGBEE_Rejoin_NotAuto);
    
    /* Re-Enabling Stop mode */
    UTIL_LPM_SetStopMode(1U << CFG_LPM_APP, UTIL_LPM_ENABLE);
    UTIL_LPM_SetOffMode(1U << CFG_LPM_APP, UTIL_LPM_DISABLE);
  }
  else
  {
   APP_DBG("WARNING: ZC LED_RED and SED LED_RED can be disalligned if a response from ZC failed, in which case both ZC and SED LED_RED will stop toggling");
   BSP_LED_Toggle(LED_RED);
   HW_TS_Start(TS_ID1, HW_TS_SERVER_4S_NB_TICKS);
   APP_DBG("TOGGLE RSP SUCCESS from %#08llx",rsp->src.extAddr);
  }
}



/* USER CODE END FD_LOCAL_FUNCTIONS */
